export default function DeanWord() {
  return (
    <main>
      <h1>Слово декана</h1>
      <p>
        БиоТех Университета ИТМО рад открыть для вас свои двери. Здесь, в самом
        сердце Санкт-Петербурга, под одним флагом объединены фуд-, эко-, агро- и
        геномные биотехнологии. Развиваемая на факультете экосистема создаст
        атмосферу успеха и для обучающихся, заинтересованных в инжиниринге
        собственного будущего, и для экспертов, стремящихся реализовать своё
        самое смелое, часто опережающее время видение.
      </p>
      <p>
        Индустриально-образовательное партнёрство и интернационализация,
        образование, отвечающее потребностям реального сектора экономики —
        фундамент, на котором твёрдо стоит БиоТех сегодня.
      </p>
      <p>С уважением, Михаил Курушкин</p>
    </main>
  );
}
