export default function Mission() {
  return (
    <main>
      <h1>Миссия, история и традиции</h1>
      <p>
        БиоТех ИТМО — динамично развивающийся факультет, где биотехнология,
        биофармацевтика и пищевые науки разворачиваются в тесной взаимосвязи с
        индустрией
      </p>
      <p>
        Факультет берёт своё начало от Института холодильной промышленности
        (действовавшего с 1931 по 2011 годы) и являвшегося наследником
        Императорского коммерческого училища, корни которого уходят в 1772 год.
      </p>
      <p>
        В 2011 году вуз с шестью факультетами был присоединён к Университету
        ИТМО как Институт холода и биотехнологий. В 2015 году Институт был
        окончательно расформирован: на его базе были созданы факультет
        холодильной, криогенной техники и кондиционирования и факультет пищевых
        биотехнологий и инженерии университета ИТМО.
      </p>
      <p>
        Свою новейшую историю факультет биотехнологий начинает с 2020 года,
        когда он получил новое название и концепцию развития, которую мы
        продолжаем реализовывать по сегодняшний день.
      </p>
    </main>
  );
}
