import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@/components/ui/accordion";
import Link from "next/link";

export function FaqContent() {
  return (
    <Accordion type="single" collapsible className="flex flex-col gap-3">
      <AccordionItem value="q1">
        <AccordionTrigger>
          Обязательно ли быть трудоустроенным для того чтобы защищать ВКР в формате индустриального проекта со своей темой, которая будет одобрена
          индустриальным партнёром и факультетом? Возможно ли сначала предложить
          тему, а потом устроиться на практику для её реализации?
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Нет, быть трудоустроенным для защиты ВКР в формате индустриального
            проекта совершенно не обязательно. Если компания готова вас принять
            на практику де-юре и де-факто, то ИТМО (ФБТ) заключит с компанией
            договор о практической подготовке и официально направит вас на практику в согласованную организацию для выполнения индустриального
            проекта.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q2">
        <AccordionTrigger>
          Какую занятость предполагает индустриальный проект? Реально ли
          совмещать его с работой в другом месте? Или стажировка оплачивается и не нужно переживать о базовых потребностях хоть сколько-то?
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Каждый индустриальный проект предполагает разную занятость, нужно по факту общаться с представителем компании. Практика занимает в учебном плане магистратуры занимает 1728 часов (3 и 4 семестры), а в учебном плане бакалавриата — 648 часов (8 семестр).
          </p>
          <p>
            Реальность совмещения — это неизмеримое понятие, опыт каждого
            студента индивидуальный. Можно обратиться к коллегам на год старше
            и оценить опыт совмещения, если у кого-то из студентов такой опыт
            есть.
          </p>
          <p>
            Оплата зависит от места стажировки, в списке проектов от факультета
            будет графа, посвященная оплате. При этом вопрос оплаты мы рекомендуем напрямую обсуждать с представителем организации.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q3">
        <AccordionTrigger>
          Стажировка предполагает обязательное трудоустройство?
        </AccordionTrigger>
        <AccordionContent>
          <p>Нет, не предполагает.</p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q4">
        <AccordionTrigger>
          При выполнении вкр типа «Индустриальный проект» возможно ли выбрать
          тему без проведения каких-то лабораторных работ? Например, аудиты,
          регистрация лекарственных препаратов.
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Да, возможно выбрать тему без проведения лабораторных работ (см.
            описания тем индустриальных проектов выше, в блоке «индустриальный
            проект»).
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q5">
        <AccordionTrigger>
          Когда необходимо предоставить точную тему ВКР, если я договариваюсь с производством самостоятельно?
        </AccordionTrigger>
        <AccordionContent>
          <p>
            До начала летних каникул, т.е. в пределах 30 июня 2026, тема и место стажировки должны быть согласованы.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q6">
        <AccordionTrigger>
          Можно ли предложить несколько своих тем индустриального проекта,
          ранжированных по приоритетности? В целях, если одну тему не одобрит
          университет
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Если все темы согласованы с представителем организации, в которой
            вы планируете над этими темами работать, то да.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q7">
        <AccordionTrigger>
          Если выполнять вкр на площадке работодателя, как быть с конфиденциальными данными?
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Подписать соглашение о неразглашении, а также плотно работать с секретарем государственной экзаменационной комиссии (ГЭК), чтобы в тексте ВКР были корректно, по всем правилам скрыты данные.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q8">
        <AccordionTrigger>
          Обязательно ли для ВКР как индустриальный проект иметь индустриального
          партнера или можно указать подразделение ИТМО, при условии выполнения
          ВКР в ИТМО.
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Для индустриального проекта обязательно указать организацию-партнера.
            ИТМО не является индустриальным партнером для самого себя.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q9">
        <AccordionTrigger>
          Что значит дедлайны смещены вперед относительно общих?
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Это значит, что в связи с архитектурой образовательной программы
            (годовой практикой в частности) многие действия на ФБТ необходимо
            выполнить намного раньше, чем это предусмотрено для студентов других
            факультетов.
          </p>
          <p>
            Например, тему ВКР и план работ студенты ФБТ защищают на проектном
            семинаре в сентябре-октябре 2026. При этом официальное закрепление
            темы ВКР в ИСУ на уровне ИТМО происходит в марте 2027.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q10">
        <AccordionTrigger>
          Хочется заранее (до витрины, в ближайшее время) узнать список
          партнеров, на площадках которых можно реализовать индустриальный
          проект или примерные области пищевой промышленности, которые будут
          представлены (молочная, кофе, масложировая, соковая и тд)
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Какова природа вашего желания? Какие действия вы хотели бы
            предпринять, узнав список или области? Приходите на встречу 21 апреля, давайте обсудим это синхронно.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q11">
        <AccordionTrigger>
          Возможно ли выполнение индустриального проекта от ПИШ ИТМО?
        </AccordionTrigger>
        <AccordionContent>
          <p>Короткий ответ — да.</p>
          <p>
            Далее нам совместно необходимо работать с нюансами. Например, если место практики — ИТМО, то доступный для вас тип ВКР — это научная
            статья. Если официальное место практики — партнёр ПИШ (Газпромнефть,
            Татнефть и т.п.), то вашу ВКР можно оформить как индустриальный
            проект.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q12">
        <AccordionTrigger>
          Если науч. рук. из ИТМО, но не с ФБТ, можно ли писать ВКР с ней/ним?
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Да, конечно. Руководителем ВКР может быть любой преподаватель ИТМО.
            Важно на этапе выбора типа ВКР сообщить нам имя руководителя,
            согласившегося с вами работать, чтобы мы (деканат и преподаватель
            не-ФБТ) напрямую обсудили взаимные ожидания.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q13">
        <AccordionTrigger>
          Можно ли поменять место/тип ВКР и до какого момента, если что-то не складывается/не интересна тема?
        </AccordionTrigger>
        <AccordionContent>
          <p>По умолчанию смена места/темы не предусмотрены.</p>
          <p>
            Не стоит подавать заявки на те проекты, которые вы не готовы
            выполнять.
          </p>
          <p>
            Все вопросы по типу «не складывается» мы решаем индивидуально и в случае, когда это действительно происходит.
          </p>
          <p>
            Решаются только те проблемы, которые в реальности существуют, а не те, которые лишь могут гипотетически возникнуть.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q14">
        <AccordionTrigger>
          По опыту прошлых лет, всегда ли «стажировка» начинается с 1 сентября
          или можно позже? Когда это можно конкретно узнать и соориентироваться
          по датам?
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Конкретно согласовать дату выхода на стажировку вы можете с представителем организации, в которую будете распределены.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q15">
        <AccordionTrigger>
          В какое время примерно проходит защита ВКР?
        </AccordionTrigger>
        <AccordionContent>
          <p>В июне 2027 в дневное время.</p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q16">
        <AccordionTrigger>
          Возможно ли такое, что сейчас не получится попасть на стажировку?
          Студентов будет больше, чем тем ВКР на витрине. Что делать в таком
          случае?
        </AccordionTrigger>
        <AccordionContent>
          <p>Все студенты будут распределены на проектную работу.</p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q17">
        <AccordionTrigger>
          Будут ли на витрине ВКР варианты не из Санкт-Петербурга, а например
          Москвы или Московской области? Другие регионы? (пищевое направление).
        </AccordionTrigger>
        <AccordionContent>
          <p>
            По умолчанию мы размещаем на витрине задания от компаний, которые
            находятся в Санкт-Петербурге. У некоторых из этих компаний есть
            площадки и в других городах.
          </p>
          <p>
            Если у вас есть запрос на прохождение стажировки в конкретном городе
            на конкретном предприятии, пожалуйста, направьте ваш подробный
            запрос и резюме Михаилу Вячеславовичу Курушкину, Светлане Юрьевне
            Султановой и Надежде Александровне Серовой (одно письмо всем
            коллегам сразу, т.е. в вашем письме должно быть три получателя).
            Ваше резюме должно быть подготовлено в конструкторе{" "}
            <Link
              href="https://icanchoose.ru"
              target="_blank"
              rel="noreferrer"
              className="text-accent underline underline-offset-2"
            >
              https://icanchoose.ru
            </Link>{" "}
            или его аналогах, а также заранее согласовано с Надеждой
            Александровной.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q18">
        <AccordionTrigger>
          Возможно ли прохождение практики и выполнение ВКР в удаленном
          формате? Существуют ли требования к месту нахождения студента во время
          практики (обязательно находиться на территории РФ)?
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Формат (онлайн/офлайн) зависит от конкретной ВКР, её типа, места
            практики и т.д. Требования к месту нахождения также зависят от конкретной ВКР.
          </p>
          <p>
            Преддипломная практика, предзащита и защита ВКР проходят в офлайн
            формате. Примерно с апреля по июнь 2027 вам необходимо будет
            находиться в Санкт-Петербурге.
          </p>
          <p>
            Универсального однозначного ответа на ваш вопрос нет, нужна
            конкретика. Изложите нам (М.В. Курушкину и С.Ю. Султановой) в письме открыто и подробно ваши планы и стремления, чтобы мы могли
            совместно разработать такой план действий, который позволит вам
            успешно завершить обучение.
          </p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q19">
        <AccordionTrigger>
          Можно ли проходить практику и писать ВКР на базе медицинской
          организации (частной клиники), если она будет соответствовать
          направлению и квалификации?
        </AccordionTrigger>
        <AccordionContent>
          <p>Да.</p>
        </AccordionContent>
      </AccordionItem>

      <AccordionItem value="q20">
        <AccordionTrigger>
          Можно ли взять академический отпуск сроком на 1 год в связи с переездом за границу? Нужно ли будет заново выбирать тему ВКР после
          выхода из отпуска или можно продолжить работу с тем же индустриальным
          партнёром?
        </AccordionTrigger>
        <AccordionContent>
          <p>
            Вам необходимо изучить информацию об академических отпусках (АО) на сайте студенческого офиса (СО). АО находятся в ведении СО.
          </p>
          <p>
            Если вы уже сейчас планируете уйти в АО, то вам не стоит участвовать
            в конкурсе на индустриальные проекты от факультета. Вы займёте
            место, которое мог бы занять тот студент, который наверняка готов
            выполнять проектную работу. Это место «сгорит» и туда никто не будет
            распределён, что, среди прочего, плохо скажется на репутации
            проекта в глазах организации-партнёра.
          </p>
          <p>
            В вашем вопросе слишком мало данных, чтобы мы могли на него ответить
            таким образом, чтобы реально вам помочь. Напишите Светлане Юрьевне
            Султановой, чтобы мы могли назначить индивидуальную встречу и обсудить конкретно ваши планы.
          </p>
        </AccordionContent>
      </AccordionItem>
    </Accordion>
  );
}
